-- INSERT
-- добавим жанры
INSERT INTO musicgenre(name) 
VALUES('Диско'), ('Русская поп-музыка'), ('Русский рэп'), ('Фонк'), ('Техно');

-- добавим артистов
INSERT INTO artists(name) 
VALUES('Boris Brejche'), ('JONY'), ('Руки Вверх!'), ('Баста'), ('Каста'),
('Элджей'), ('KEAN DYSSO'), ('Jon Hopkins');

-- заполняем связь жанр-артист
INSERT INTO genreartists(musicgenre_id, artists_id)
VALUES(5, 1), (2, 2), (2, 3), (3, 4), (3, 5), (3, 6), (4, 7), (5, 8);

-- добавим альбомы
INSERT INTO album(name, year_release)
VALUES ('Chameleon', 2020), ('Список твоих друзей', 2019), ('Полечу за тобой', 2019), 
('40', 2021), ('Альбомба', 2021), ('Sayonara Boy', 2018), ('Hilary', 2017), ('Singularity', 2020);

-- Заполняем связь альбом-артист
INSERT INTO albumartists(artists_id, album_id)
VALUES (1, 1), (2, 4), (2, 2), (3, 3), (4, 4), (5, 5), (6, 6), (7, 7), (8, 8);

-- добавим музыкальные треки
INSERT INTO musictrack(album_id, name, duration)
VALUES (1, 'Chameleon', '0:7:50'), (1, 'The Final', '0:6:48'), (2, 'Звезда', '0:2:10'), (2, 'Аллея', '0:2:22'), (3, 'Полечу за тобой', '0:4:10'), 
(4, 'мой самолет', '0:2:25'), (4, 'Дочь огня', '0:4:09'), (4, 'Молодость', '0:4:50'), (5, 'Муха', '0:1:37'), (5, 'Я сам', '0:2:16'),
(6, 'Vrum Vrum', '0:3:59'), (6, 'Vercace', '0:3:02'), (6, 'Fontan', '0:3:32'), (7, 'Hilary', '0:3:42'), (7, 'my car', '0:2:11'),
(8, 'Singularity', '0:6:29'), (8, 'COSM', '0:7:08');

-- добавим музыкальные сборники
INSERT INTO collection(name, year_release)
VALUES ('Сборник №1', 2017), ('Сборник №2', 2018), ('Сборник №3', 2019), ('Сборник №4', 2019), ('Сборник №5', 2020), ('Сборник №6', 2020), 
('Сборник №7', 2021), ('Сборник №8', 2022);

-- Заполняем связь сборник-музыкальные треки
INSERT INTO collectionmusictrack(collection_id, musictrack_id)
VALUES (1, 14), (1, 15), (2, 14), (2, 15), (2, 11), (2, 12), (3, 14), (3, 15), (3, 12), (3, 13), (3, 3), (3, 4), (4, 3), (4, 4), (4, 5), (5, 16), (5, 17),
(5, 1), (6, 5), (6, 6), (6, 7), (7, 7), (7, 8), (7, 9), (8, 7), (8, 8), (8, 9), (8, 10);

